#version: 0.2 - Trained by `huggingface/tokenizers`
= C
C C
C =C
C (
O )
=C C=C
= O)
1 ]
( C
C( =O)
H 1]
C @
[ C@
= N
C 2
C 1
C 3
=CC=C C=C
) C=C
(C )
) =C
[C@ @
( =O)
[C@ H1]
[C@@ H1]
=CC=C (
C( C
CC CC
N =C
C(=O) N
C 4
CC 1
C O
C N
3 )
2 )
( CC
F )
CC N
( N
[ N
=CC=C (C
( O)
C =
)C=C 1
O C
C( N
C =N
C2 =C
4 )
C(C )
CO C1
O =C
) N
[N H1]
O CC
C3 =C
S (=O)
)=C 1
S(=O) (=O)
C 5
C )
CC 2
N C(=O)
C3 =CC=CC=C
N 2
( F)
=C C(
+ 1]
CC (=O)
=CC=C C(
C [C@H1]
1 )
C( F)
[N +1]
CC 3
C( =C
=CC=C(C l
CC (C)
F )C=C
C(F) (F)
/ C=C
C(C l
C2 =CC=CC=C
=CC=CC=C 4
C [C@@H1]
( C(=O)
[C@ ]
=CC=C 2
C1 =C
C2 =N
C1 =CC=C(
(C 3
(C 2
CC O
2 )C=C1
N 1
C3=CC=CC=C 3
5 )
C2 =CC=C(
C l
- 1]
= O
[C@@ ]
CN 1
O -1]
[ O-1]
C3 =CC=C(
N 3
C4 =C
C1 =N
C= 2
O) =C
F )=C
C=C 1
CC1 =C
=CC=CC=C 1
( O
=CC=C(Cl )C=C
B r
CC 4
C2 =CC=C
C4 =CC=CC=C4
CC CN
C(C) (C)
(N )
C(Cl )=C
OC )
C2=CC=CC=C 2
C(=O) O
C= 1
/C=C /
[C@H1] 1
[C@@H1] 1
C3 =CC=C
C3 =N
CCN (CC
(C 4
COC1 =CC=C(
)C=C 2
C(N )
( C(=O)N
O=C (N
N (CC
(=O) [O-1]
C( =N
[C@H1] 2
[C@H1] (O)
[N+1] (=O)[O-1]
C= 3
C=C C=C
(N C(=O)
C(C )=C
C2=C 1
CCCC CCCC
CC(=O) N
CC OCC
=CC=C(C 2
[C@@H1] (O)
CC1 =CC=C(
C 6
N=C 2
[C@@H1] 2
# N
[C@@H1] (CC
O) C=C
O=C 1
)C=C 3
N (C)
=CC=CC=C 5
N=C 3
=CC=CC=C 4)
C( OC
3) =N
N =N
[C@H1] (CC
[C@H1] (C)
CO C(=O)
N 4
=CC=CC=C 3
[C@H1] 3
N=C 1
[C@@H1] 3
[C@H1] (C
C1 =O
=CC=C( F)C=C
C S
)=C 2
= 1
=CC=C 3
=CC=CC=C 2)
(C) CC
=CC=CC=C 3)
=CC=C 1
C(C 4
