{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Strip",
    "strip_left": false,
    "strip_right": true
  },
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          2
        ],
        "tokens": [
          "</s>"
        ]
      },
      "<s>": {
        "id": "<s>",
        "ids": [
          1
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "vocab": {
      "<pad>": 0,
      "<s>": 1,
      "</s>": 2,
      "<unk>": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "=": 24,
      "@": 25,
      "A": 26,
      "B": 27,
      "C": 28,
      "D": 29,
      "E": 30,
      "F": 31,
      "G": 32,
      "H": 33,
      "I": 34,
      "K": 35,
      "L": 36,
      "M": 37,
      "N": 38,
      "O": 39,
      "P": 40,
      "R": 41,
      "S": 42,
      "T": 43,
      "U": 44,
      "V": 45,
      "W": 46,
      "X": 47,
      "Y": 48,
      "Z": 49,
      "[": 50,
      "\\": 51,
      "]": 52,
      "a": 53,
      "b": 54,
      "c": 55,
      "d": 56,
      "e": 57,
      "f": 58,
      "g": 59,
      "h": 60,
      "i": 61,
      "k": 62,
      "l": 63,
      "m": 64,
      "n": 65,
      "o": 66,
      "p": 67,
      "r": 68,
      "s": 69,
      "t": 70,
      "u": 71,
      "v": 72,
      "w": 73,
      "x": 74,
      "y": 75,
      "z": 76,
      "=C": 77,
      "CC": 78,
      "C=C": 79,
      "C(": 80,
      "O)": 81,
      "=CC=C": 82,
      "=O)": 83,
      "1]": 84,
      "(C": 85,
      "C(=O)": 86,
      "H1]": 87,
      "C@": 88,
      "[C@": 89,
      "=N": 90,
      "C2": 91,
      "C1": 92,
      "C3": 93,
      "=CC=CC=C": 94,
      ")C=C": 95,
      "(C)": 96,
      ")=C": 97,
      "[C@@": 98,
      "(=O)": 99,
      "[C@H1]": 100,
      "[C@@H1]": 101,
      "=CC=C(": 102,
      "C(C": 103,
      "CCCC": 104,
      "N=C": 105,
      "C(=O)N": 106,
      "C4": 107,
      "CC1": 108,
      "CO": 109,
      "CN": 110,
      "3)": 111,
      "2)": 112,
      "(CC": 113,
      "F)": 114,
      "CCN": 115,
      "(N": 116,
      "[N": 117,
      "=CC=C(C": 118,
      "(O)": 119,
      "C=": 120,
      ")C=C1": 121,
      "OC": 122,
      "C(N": 123,
      "C=N": 124,
      "C2=C": 125,
      "4)": 126,
      "C(C)": 127,
      "COC1": 128,
      "O=C": 129,
      ")N": 130,
      "[NH1]": 131,
      "OCC": 132,
      "C3=C": 133,
      "S(=O)": 134,
      ")=C1": 135,
      "S(=O)(=O)": 136,
      "C5": 137,
      "C)": 138,
      "CC2": 139,
      "NC(=O)": 140,
      "C3=CC=CC=C": 141,
      "N2": 142,
      "(F)": 143,
      "=CC(": 144,
      "+1]": 145,
      "CC(=O)": 146,
      "=CC=CC(": 147,
      "C[C@H1]": 148,
      "1)": 149,
      "C(F)": 150,
      "[N+1]": 151,
      "CC3": 152,
      "C(=C": 153,
      "=CC=C(Cl": 154,
      "CC(C)": 155,
      "F)C=C": 156,
      "C(F)(F)": 157,
      "/C=C": 158,
      "C(Cl": 159,
      "C2=CC=CC=C": 160,
      "=CC=CC=C4": 161,
      "C[C@@H1]": 162,
      "(C(=O)": 163,
      "[C@]": 164,
      "=CC=C2": 165,
      "C1=C": 166,
      "C2=N": 167,
      "C1=CC=C(": 168,
      "(C3": 169,
      "(C2": 170,
      "CCO": 171,
      "2)C=C1": 172,
      "N1": 173,
      "C3=CC=CC=C3": 174,
      "5)": 175,
      "C2=CC=C(": 176,
      "Cl": 177,
      "-1]": 178,
      "=O": 179,
      "[C@@]": 180,
      "CN1": 181,
      "O-1]": 182,
      "[O-1]": 183,
      "C3=CC=C(": 184,
      "N3": 185,
      "C4=C": 186,
      "C1=N": 187,
      "C=2": 188,
      "O)=C": 189,
      "F)=C": 190,
      "C=C1": 191,
      "CC1=C": 192,
      "=CC=CC=C1": 193,
      "(O": 194,
      "=CC=C(Cl)C=C": 195,
      "Br": 196,
      "CC4": 197,
      "C2=CC=C": 198,
      "C4=CC=CC=C4": 199,
      "CCCN": 200,
      "C(C)(C)": 201,
      "(N)": 202,
      "C(Cl)=C": 203,
      "OC)": 204,
      "C2=CC=CC=C2": 205,
      "C(=O)O": 206,
      "C=1": 207,
      "/C=C/": 208,
      "[C@H1]1": 209,
      "[C@@H1]1": 210,
      "C3=CC=C": 211,
      "C3=N": 212,
      "CCN(CC": 213,
      "(C4": 214,
      "COC1=CC=C(": 215,
      ")C=C2": 216,
      "C(N)": 217,
      "(C(=O)N": 218,
      "O=C(N": 219,
      "N(CC": 220,
      "(=O)[O-1]": 221,
      "C(=N": 222,
      "[C@H1]2": 223,
      "[C@H1](O)": 224,
      "[N+1](=O)[O-1]": 225,
      "C=3": 226,
      "C=CC=C": 227,
      "(NC(=O)": 228,
      "C(C)=C": 229,
      "C2=C1": 230,
      "CCCCCCCC": 231,
      "CC(=O)N": 232,
      "CCOCC": 233,
      "=CC=C(C2": 234,
      "[C@@H1](O)": 235,
      "CC1=CC=C(": 236,
      "C6": 237,
      "N=C2": 238,
      "[C@@H1]2": 239,
      "#N": 240,
      "[C@@H1](CC": 241,
      "O)C=C": 242,
      "O=C1": 243,
      ")C=C3": 244,
      "N(C)": 245,
      "=CC=CC=C5": 246,
      "N=C3": 247,
      "=CC=CC=C4)": 248,
      "C(OC": 249,
      "3)=N": 250,
      "N=N": 251,
      "[C@H1](CC": 252,
      "[C@H1](C)": 253,
      "COC(=O)": 254,
      "N4": 255,
      "=CC=CC=C3": 256,
      "[C@H1]3": 257,
      "N=C1": 258,
      "[C@@H1]3": 259,
      "[C@H1](C": 260,
      "C1=O": 261,
      "=CC=C(F)C=C": 262,
      "CS": 263,
      ")=C2": 264,
      "=1": 265,
      "=CC=C3": 266,
      "=CC=CC=C2)": 267,
      "(C)CC": 268,
      "=CC=CC=C3)": 269,
      "=CC=C1": 270,
      "C(C4": 271
    },
    "merges": [
      "= C",
      "C C",
      "C =C",
      "C (",
      "O )",
      "=C C=C",
      "= O)",
      "1 ]",
      "( C",
      "C( =O)",
      "H 1]",
      "C @",
      "[ C@",
      "= N",
      "C 2",
      "C 1",
      "C 3",
      "=CC=C C=C",
      ") C=C",
      "(C )",
      ") =C",
      "[C@ @",
      "( =O)",
      "[C@ H1]",
      "[C@@ H1]",
      "=CC=C (",
      "C( C",
      "CC CC",
      "N =C",
      "C(=O) N",
      "C 4",
      "CC 1",
      "C O",
      "C N",
      "3 )",
      "2 )",
      "( CC",
      "F )",
      "CC N",
      "( N",
      "[ N",
      "=CC=C (C",
      "( O)",
      "C =",
      ")C=C 1",
      "O C",
      "C( N",
      "C =N",
      "C2 =C",
      "4 )",
      "C(C )",
      "CO C1",
      "O =C",
      ") N",
      "[N H1]",
      "O CC",
      "C3 =C",
      "S (=O)",
      ")=C 1",
      "S(=O) (=O)",
      "C 5",
      "C )",
      "CC 2",
      "N C(=O)",
      "C3 =CC=CC=C",
      "N 2",
      "( F)",
      "=C C(",
      "+ 1]",
      "CC (=O)",
      "=CC=C C(",
      "C [C@H1]",
      "1 )",
      "C( F)",
      "[N +1]",
      "CC 3",
      "C( =C",
      "=CC=C(C l",
      "CC (C)",
      "F )C=C",
      "C(F) (F)",
      "/ C=C",
      "C(C l",
      "C2 =CC=CC=C",
      "=CC=CC=C 4",
      "C [C@@H1]",
      "( C(=O)",
      "[C@ ]",
      "=CC=C 2",
      "C1 =C",
      "C2 =N",
      "C1 =CC=C(",
      "(C 3",
      "(C 2",
      "CC O",
      "2 )C=C1",
      "N 1",
      "C3=CC=CC=C 3",
      "5 )",
      "C2 =CC=C(",
      "C l",
      "- 1]",
      "= O",
      "[C@@ ]",
      "CN 1",
      "O -1]",
      "[ O-1]",
      "C3 =CC=C(",
      "N 3",
      "C4 =C",
      "C1 =N",
      "C= 2",
      "O) =C",
      "F )=C",
      "C=C 1",
      "CC1 =C",
      "=CC=CC=C 1",
      "( O",
      "=CC=C(Cl )C=C",
      "B r",
      "CC 4",
      "C2 =CC=C",
      "C4 =CC=CC=C4",
      "CC CN",
      "C(C) (C)",
      "(N )",
      "C(Cl )=C",
      "OC )",
      "C2=CC=CC=C 2",
      "C(=O) O",
      "C= 1",
      "/C=C /",
      "[C@H1] 1",
      "[C@@H1] 1",
      "C3 =CC=C",
      "C3 =N",
      "CCN (CC",
      "(C 4",
      "COC1 =CC=C(",
      ")C=C 2",
      "C(N )",
      "( C(=O)N",
      "O=C (N",
      "N (CC",
      "(=O) [O-1]",
      "C( =N",
      "[C@H1] 2",
      "[C@H1] (O)",
      "[N+1] (=O)[O-1]",
      "C= 3",
      "C=C C=C",
      "(N C(=O)",
      "C(C )=C",
      "C2=C 1",
      "CCCC CCCC",
      "CC(=O) N",
      "CC OCC",
      "=CC=C(C 2",
      "[C@@H1] (O)",
      "CC1 =CC=C(",
      "C 6",
      "N=C 2",
      "[C@@H1] 2",
      "# N",
      "[C@@H1] (CC",
      "O) C=C",
      "O=C 1",
      ")C=C 3",
      "N (C)",
      "=CC=CC=C 5",
      "N=C 3",
      "=CC=CC=C 4)",
      "C( OC",
      "3) =N",
      "N =N",
      "[C@H1] (CC",
      "[C@H1] (C)",
      "CO C(=O)",
      "N 4",
      "=CC=CC=C 3",
      "[C@H1] 3",
      "N=C 1",
      "[C@@H1] 3",
      "[C@H1] (C",
      "C1 =O",
      "=CC=C( F)C=C",
      "C S",
      ")=C 2",
      "= 1",
      "=CC=C 3",
      "=CC=CC=C 2)",
      "(C) CC",
      "=CC=CC=C 3)",
      "=CC=C 1",
      "C(C 4"
    ]
  }
}