{"<pad>":0,"<s>":1,"</s>":2,"<unk>":3,"#":4,"%":5,"(":6,")":7,"*":8,"+":9,"-":10,".":11,"/":12,"0":13,"1":14,"2":15,"3":16,"4":17,"5":18,"6":19,"7":20,"8":21,"9":22,":":23,"=":24,"@":25,"A":26,"B":27,"C":28,"D":29,"E":30,"F":31,"G":32,"H":33,"I":34,"K":35,"L":36,"M":37,"N":38,"O":39,"P":40,"R":41,"S":42,"T":43,"U":44,"V":45,"W":46,"X":47,"Y":48,"Z":49,"[":50,"\\":51,"]":52,"a":53,"b":54,"c":55,"d":56,"e":57,"f":58,"g":59,"h":60,"i":61,"k":62,"l":63,"m":64,"n":65,"o":66,"p":67,"r":68,"s":69,"t":70,"u":71,"v":72,"w":73,"x":74,"y":75,"z":76,"=C":77,"CC":78,"C=C":79,"C(":80,"O)":81,"=CC=C":82,"=O)":83,"1]":84,"(C":85,"C(=O)":86,"H1]":87,"C@":88,"[C@":89,"=N":90,"C2":91,"C1":92,"C3":93,"=CC=CC=C":94,")C=C":95,"(C)":96,")=C":97,"[C@@":98,"(=O)":99,"[C@H1]":100,"[C@@H1]":101,"=CC=C(":102,"C(C":103,"CCCC":104,"N=C":105,"C(=O)N":106,"C4":107,"CC1":108,"CO":109,"CN":110,"3)":111,"2)":112,"(CC":113,"F)":114,"CCN":115,"(N":116,"[N":117,"=CC=C(C":118,"(O)":119,"C=":120,")C=C1":121,"OC":122,"C(N":123,"C=N":124,"C2=C":125,"4)":126,"C(C)":127,"COC1":128,"O=C":129,")N":130,"[NH1]":131,"OCC":132,"C3=C":133,"S(=O)":134,")=C1":135,"S(=O)(=O)":136,"C5":137,"C)":138,"CC2":139,"NC(=O)":140,"C3=CC=CC=C":141,"N2":142,"(F)":143,"=CC(":144,"+1]":145,"CC(=O)":146,"=CC=CC(":147,"C[C@H1]":148,"1)":149,"C(F)":150,"[N+1]":151,"CC3":152,"C(=C":153,"=CC=C(Cl":154,"CC(C)":155,"F)C=C":156,"C(F)(F)":157,"/C=C":158,"C(Cl":159,"C2=CC=CC=C":160,"=CC=CC=C4":161,"C[C@@H1]":162,"(C(=O)":163,"[C@]":164,"=CC=C2":165,"C1=C":166,"C2=N":167,"C1=CC=C(":168,"(C3":169,"(C2":170,"CCO":171,"2)C=C1":172,"N1":173,"C3=CC=CC=C3":174,"5)":175,"C2=CC=C(":176,"Cl":177,"-1]":178,"=O":179,"[C@@]":180,"CN1":181,"O-1]":182,"[O-1]":183,"C3=CC=C(":184,"N3":185,"C4=C":186,"C1=N":187,"C=2":188,"O)=C":189,"F)=C":190,"C=C1":191,"CC1=C":192,"=CC=CC=C1":193,"(O":194,"=CC=C(Cl)C=C":195,"Br":196,"CC4":197,"C2=CC=C":198,"C4=CC=CC=C4":199,"CCCN":200,"C(C)(C)":201,"(N)":202,"C(Cl)=C":203,"OC)":204,"C2=CC=CC=C2":205,"C(=O)O":206,"C=1":207,"/C=C/":208,"[C@H1]1":209,"[C@@H1]1":210,"C3=CC=C":211,"C3=N":212,"CCN(CC":213,"(C4":214,"COC1=CC=C(":215,")C=C2":216,"C(N)":217,"(C(=O)N":218,"O=C(N":219,"N(CC":220,"(=O)[O-1]":221,"C(=N":222,"[C@H1]2":223,"[C@H1](O)":224,"[N+1](=O)[O-1]":225,"C=3":226,"C=CC=C":227,"(NC(=O)":228,"C(C)=C":229,"C2=C1":230,"CCCCCCCC":231,"CC(=O)N":232,"CCOCC":233,"=CC=C(C2":234,"[C@@H1](O)":235,"CC1=CC=C(":236,"C6":237,"N=C2":238,"[C@@H1]2":239,"#N":240,"[C@@H1](CC":241,"O)C=C":242,"O=C1":243,")C=C3":244,"N(C)":245,"=CC=CC=C5":246,"N=C3":247,"=CC=CC=C4)":248,"C(OC":249,"3)=N":250,"N=N":251,"[C@H1](CC":252,"[C@H1](C)":253,"COC(=O)":254,"N4":255,"=CC=CC=C3":256,"[C@H1]3":257,"N=C1":258,"[C@@H1]3":259,"[C@H1](C":260,"C1=O":261,"=CC=C(F)C=C":262,"CS":263,")=C2":264,"=1":265,"=CC=C3":266,"=CC=CC=C2)":267,"(C)CC":268,"=CC=CC=C3)":269,"=CC=C1":270,"C(C4":271}